package section06;

/*
 * 배열
 * 	다수의 데이터를 저장하고 처리하기 위해 사용하는 데이터 표현 방법
 * 	여러 개의 데이터를 하나의 묶음으로 관리할 수 있는 데이터 구조.
 *  변수 개수를 줄일 수 있다.	
 * 
 * 
 */

public class Array01 {
	public static void main(String[] args) {
		
	
/*
1						[0][0]									 i = 0 , [0][0]
2 8						[1][0],[1][1]							 i = 1,  [0][1] / [1][0]
15 9 3					[2][0],[2][1],[2][2]					 i = 2,  [2][0] / [1][1] / [0][2]
4 10 16 22				3 0	/ 3 1 / 3 2 / 3 3					 i = 3,  [0][3] / [1][2] / [3][0]
29 23 17 11 5			4 0 / 4 1 / 4 2 / 4 3 / 4 4 / 			 i = 4,  [4][0] / [3][1] / [2][2] / [1][3] / [0][4]
6 12 18 24 30 36		5 0 / 5 1/ 5 2 / 5 3/ 5 4 / 5 5			 i = 5,  [0][5] / [1][4] / [2][3] / [3][2] / [4][1] / [5][0]
43 37 31 25 19 13 7		6 0 / 6 1 / 6 2 / 6 3/ 6 4/ 6 5 6 6		 i = 6,  [6][0] / [5][1] / [4][2] / [3][3] / [2][4] / [1][5] / [0][6]

14 20 26 32 38 44												 i = 7,	 [1][6] / [2][5] / [3][4] / [4][3] / [5][2] / [6][1] 		1 2 3 4 5 6						6 = i
45 39 33 27 21													 i = 8,  [6][2] / [5][3] / [4][4] / [3][5] / [2][6]					2 3 4 5 6						5
28 34 40 46														 i = 9.  [3][6] / [4][5] / [5][4] / [6][3]							3 4 5 6							4
47 41 35														 i = 10, [6][4] / [5][5] / [4][6]										4 5 6						3
42 48															 i = 11, [5][6] / [6][5]											5 6								2
49																 i = 12, [6][6]															6							1
 */
		   int[][] array = new int[7][7];

	        int value = 1;

	        // 값 할당
	        for (int i = 0; i < 7; i++) {
	            for (int j = 0; j <= i; j++) {
	                array[i-j][j] = value;
	                value++;
	            }
	        }
	        for (int i = 6; i > 0; i--) {
	            for (int j = 0; j < i; j++) {
	                array[7-j-1][i-j] = value;
	                value++;
	            }
	        }
		
	        for(int i:array[0]) {
	        	System.out.print(i+" ");
	        
	        }
	        System.out.println();
	        for(int i:array[1]) {
	        	System.out.print(i+" ");
	        
	        }
		
		
		
		
		
		/*
		int[] arr= new int[49];
		
		int[][] narr= new int[0][4];
		int m=1;
		for(int i=0; i<7; i++) {
			for(int j=0; j<7; j++) {
				System.out.print(m+" ");
				arr[m-1] = m;
				m++;
			}
			
			
			System.out.println();
		}
	
		*/
	}}
	
	        
	
