package practice;

public class GenericEx {
	// 클래스가 다룰 객체를 미리 명시하는 기법
	// 제네릭 == 일반화;
    // ex ) 택시를 다루던, 버스를 다루던 그냥 자동차(일반화)라고 다룰게
	
	/* 사용방법 :
	 * 	클래스명 뒤에 <E>,<K>,<V> 와 같은 형식으로 사용
	 *  단, <> 안에는 구현 시는 알파벳, 사용시는 클래스만 들어갈수 있다.
	 * 
	 * 제네릭 클래스 : 클래스 뒤에 제네릭 기법 사용
	 * 제네릭 메서드 : 메서드 뒤에 제네릭 기법 사용
	 * 
	 * 제네릭타입 매개변수
	 * 	1) E(Element) : 배열이나 집합들의 요소 타입 지정
	 * 	2) T(Type) : 변수의 자료형과 같은 타입을 지정
	 * 	3) S,U(...) : 여러개의 제네릭 기법을 사용할 때 많이 사용
	 * 	4) K(Key) : 키 타입 지정 시 사용
	 * 	5) V(Value) : 값 타입 지정 시 사용
	 * 
	 */
}
